Revit 2027 API
ExporterIFCUtils.CreateAlternateGUID Method
 Creates a GUID for the given element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CreateAlternateGUID(
	Element pElement
)
Public Shared Function CreateAlternateGUID (
	pElement As Element
) As String
public:
static String^ CreateAlternateGUID(
	Element^ pElement
)
static member CreateAlternateGUID :
        pElement : Element -> string
Parameters
pElement Element
 The element.
Return Value
String
 The guid string.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace